tutorials/incompressibleFluid/planarContraction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.25;

deltaT          2e-4;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc graphCell(name=lineA, start=(-0.0016 0 0), end=(-0.0016 0.0128 0), U)
    #includeFunc graphCell(name=lineB, start=(-0.0048 0 0), end=(-0.0048 0.0128 0), U)
    #includeFunc graphCell(name=lineC, start=(-0.0032 0 0), end=(-0.0032 0.0128 0), U)
}

// ************************************************************************* //
